# 1450. 데일리실습 6-4. 크롤링을 통한 서비스 개발 예제4
import collections as cl

entry_record = ['이싸피', '박장고', '조실습', '이싸피', '조실습', '오디비', '임온실', '조실습', '조실습', '이싸피', '안도둑', '임온실', '최이썬', '오디비', '안도둑', '염자바', '박장고', '조실습',
                '최이썬', '조실습', '염자바', '박장고', '임온실', '임온실', '이싸피', '임온실', '오디비', '조실습', '염자바', '임온실', '박장고', '최이썬', '안도둑', '염자바', '임온실', '박장고', '이싸피', '안도둑',
                '임온실', '오디비', '최이썬', '안도둑', '이싸피', '오디비', '안도둑', '이싸피', '박장고', '박장고', '안도둑', '안도둑', '안도둑', '염자바', '최이썬', '오디비', '오디비', '최이썬', '이싸피', '임온실', '안도둑']

exit_record = ['최이썬', '조실습', '이싸피', '안도둑', '임온실', '안도둑', '이싸피', '오디비', '염자바', '박장고', '최이썬', '이싸피', '염자바', '염자바', '박장고', '임온실', '이싸피',
               '박장고', '안도둑', '염자바', '이싸피', '조실습', '조실습', '임온실', '박장고', '이싸피', '조실습', '박장고', '오디비', '안도둑', '조실습', '임온실', '안도둑', '안도둑', '임온실', '조실습', '최이썬', '안도둑', '임온실',
               '염자바', '이싸피', '임온실', '안도둑', '오디비', '안도둑', '오디비', '임온실', '염자바', '임온실', '박장고', '조실습', '이싸피', '최이썬', '최이썬', '오디비', '오디비', '염자바', '오디비', '안도둑', '박장고']

ent=dict(cl.Counter(entry_record))
newent = sorted(ent.items(), key=lambda x:-x[1])
exit=dict(cl.Counter(exit_record))
print('입장 기록 많은 Top3')
cnt=0
for i in newent:
    print(f'{i[0]} {i[1]}회')
    cnt+=1
    if cnt>2: break

print('\n출입 기록이 수상한 사람')
checkent = sorted(dict(cl.Counter(entry_record) - cl.Counter(exit_record)).items(), key=lambda x:x[1])
checkexit =  sorted(dict(cl.Counter(exit_record) - cl.Counter(entry_record)).items(), key=lambda x:x[1])
for j in checkent:
    print(f'{j[0]}은 입장 기록이 {j[1]}회 많아 더 수상합니다.')
for k in checkexit:
    print(f'{k[0]}은 퇴장 기록이 {k[1]}회 많아 더 수상합니다.')
